In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [38]:
df = pd.read_csv('salary_data_cleaned.csv')

In [39]:
df.head()

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,job_state,same_state,age,python_yn,r_yn,spark_yn,aws_yn,azure_yn,sql_yn,ml_yn
0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\r\nLocation: Albuquerque, NM\r\...",3.8,Tecolote Research\r\n3.8,"Albuquerque, NM","Goleta, CA",501 to 1000 employees,1973,Company - Private,...,NM,0,47,1,0,0,0,0,0,1
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\r\n\r\nI. General Summary\r\...,3.4,University of Maryland Medical System\r\n3.4,"Linthicum, MD","Baltimore, MD",10000+ employees,1984,Other Organization,...,MD,0,36,1,0,0,0,0,0,1
2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\r\n4.8,"Clearwater, FL","Clearwater, FL",501 to 1000 employees,2010,Company - Private,...,FL,1,10,1,0,1,0,0,1,1
3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\r\nJob ID: 310709\r...,3.8,PNNL\r\n3.8,"Richland, WA","Richland, WA",1001 to 5000 employees,1965,Government,...,WA,1,55,1,0,0,0,0,0,1
4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\r\nAffinity Solutions / Marketi...,2.9,Affinity Solutions\r\n2.9,"New York, NY","New York, NY",51 to 200 employees,1998,Company - Private,...,NY,1,22,1,0,0,0,0,1,1

In [40]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary', 'avg_salary',
       'company_txt', 'job_state', 'same_state', 'age', 'python_yn', 'r_yn',
       'spark_yn', 'aws_yn', 'azure_yn', 'sql_yn', 'ml_yn'],
      dtype='object')

In [41]:
df['job_state']

0       NM
1       MD
2       FL
3       WA
4       NY
5       TX
6       MD
7       CA
8       NY
9       NY
10      CA
11      VA
12      TX
13      WA
14      MA
15      NJ
16      MA
17      CA
18      CA
19      CO
20      WA
21      TX
22      IL
23      KY
24      VA
25      MA
26      OR
27      MA
28      CT
29      FL
      ...
712     CA
713     MD
714     PA
715     NC
716     CA
717     OH
718     IN
719     FL
720     MA
721     NY
722     IL
723     VA
724     MA
725     NC
726     CA
727     CA
728     GA
729     NY
730     MA
731     MA
732     CA
733     CA
734     MA
735     CA
736     PA
737     MA
738     TN
739     PA
740     PA
741     OH
Name: job_state, Length: 742, dtype: object

In [42]:
def title_simplifier(title):
    if 'scientist' in title.lower():
        return 'data scientist'
    elif 'data engineer' in title.lower():
        return 'data engineer'
    elif 'analyst' in title.lower():
        return 'analyst'
    elif 'machine learning' in title.lower():
        return 'mle'
    elif 'manager' in title.lower():
        return 'manager'
    elif 'director' in title.lower():
        return 'director'
    else:
        return 'na'

def seniority(title):
    if 'sr' in title.lower() or 'senior' in title.lower() or 'lead' in title.lower() or 'principal' in title.lower():
        return 'senior'
    elif 'junior' in title.lower() or 'jr' in title.lower():
        return 'junior'
    else:
        return 'na'

In [43]:
df['job_simp'] = df['Job Title'].apply(title_simplifier)

In [44]:
df['job_simp'].value_counts()

data scientist    438
data engineer     119
analyst           100
na                 41
manager            21
mle                12
director           11
Name: job_simp, dtype: int64

In [45]:
df['seniority'] = df['Job Title'].apply(seniority)
df['seniority'].value_counts()

na        519
senior    220
junior      3
Name: seniority, dtype: int64

In [49]:
#fix state Los Angles
df.job_state.value_counts()

 CA             151
 MA             103
 NY              72
 VA              41
 IL              40
 MD              35
 PA              33
 TX              28
 NC              21
 WA              21
 NJ              17
 FL              16
 OH              14
 TN              13
 CO              11
 DC              11
 UT              10
 WI              10
 IN              10
 AZ               9
 MO               9
 AL               8
 GA               6
 KY               6
 DE               6
 MI               6
 CT               5
 IA               5
 OR               4
 LA               4
 NE               4
 NM               3
 KS               3
 MN               2
 ID               2
 RI               1
 Los Angeles      1
 SC               1
Name: job_state, dtype: int64

In [54]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary', 'avg_salary',
       'company_txt', 'job_state', 'same_state', 'age', 'python_yn', 'r_yn',
       'spark_yn', 'aws_yn', 'azure_yn', 'sql_yn', 'ml_yn', 'job_simp',
       'seniority', 'job state'],
      dtype='object')

In [67]:
df['job_state'] = df.job_state.apply(lambda x: x.strip() if x.strip().lower() != 'los angeles' else 'CA')

In [68]:
df['job_state'].value_counts()

CA    152
MA    103
NY     72
VA     41
IL     40
MD     35
PA     33
TX     28
WA     21
NC     21
NJ     17
FL     16
OH     14
TN     13
CO     11
DC     11
WI     10
UT     10
IN     10
AZ      9
MO      9
AL      8
GA      6
MI      6
DE      6
KY      6
IA      5
CT      5
OR      4
LA      4
NE      4
NM      3
KS      3
MN      2
ID      2
SC      1
RI      1
Name: job_state, dtype: int64

In [76]:
df['job state'] = df['job state'].apply(lambda x: 'CA' if x.strip().lower() == 'los angeles' else x.strip())

In [77]:
df['job state'].value_counts()

CA    152
MA    103
NY     72
VA     41
IL     40
MD     35
PA     33
TX     28
WA     21
NC     21
NJ     17
FL     16
OH     14
TN     13
CO     11
DC     11
WI     10
UT     10
IN     10
AZ      9
MO      9
AL      8
GA      6
MI      6
DE      6
KY      6
IA      5
CT      5
OR      4
LA      4
NE      4
NM      3
KS      3
MN      2
ID      2
SC      1
RI      1
Name: job state, dtype: int64

In [82]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'hourly', 'employer_provided', 'min_salary', 'max_salary', 'avg_salary',
       'company_txt', 'job_state', 'same_state', 'age', 'python_yn', 'r_yn',
       'spark_yn', 'aws_yn', 'azure_yn', 'sql_yn', 'ml_yn', 'job_simp',
       'seniority'],
      dtype='object')

In [81]:
df.drop(['job state'], inplace = True, axis =1 )